Tekla Open API Reference for Tekla Structures 2025
RebarSpacing Methods
The RebarSpacing type exposes the following members.
Methods
Name | Description
Clone
 Makes a copy of this object.
Create(RebarSpacing.Offset, RebarSpacing.Offset, Int32)
 Craetes a spacing defined by number of bars.
Create(RebarSpacing.Offset, RebarSpacing.Offset, IEnumerable<RebarSpacing.ExactSpacing.Element>, RebarSpacing.ExactSpacing.Validation)
 Creates an exact spacing if the given elements are valid.
Create(RebarSpacing.SpacingType, RebarSpacing.Offset, RebarSpacing.Offset, Double)
 Create a spacing which is defined by a single distance.
IsExactFlexibleType
 Gets whether the spacing is an exact type with flexible space(s).
Top
See Also
Reference
RebarSpacing Class
Tekla.Structures.Model Namespace